
**Terraform Cloud Plan Output**



<details><summary>Show Plan(infra/aws/prod)</summary>

```

[command]/home/runner/work/_temp/c5e0f52b-18b9-402e-93a4-1b4107d8c298/terraform-bin plan -no-color
2024-05-08T23:35:00.760Z [INFO]  Terraform version: 1.8.1
2024-05-08T23:35:00.760Z [INFO]  Go runtime version: go1.22.1
2024-05-08T23:35:00.760Z [INFO]  CLI args: []string{"/home/runner/work/_temp/c5e0f52b-18b9-402e-93a4-1b4107d8c298/terraform-bin", "plan", "-no-color"}
2024-05-08T23:35:00.761Z [INFO]  CLI command args: []string{"plan", "-no-color"}
2024-05-08T23:35:00.766Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=0b2bde46-d9c8-d358-755d-356691ce35fd tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2024-05-08T23:35:01.328Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=0b2bde46-d9c8-d358-755d-356691ce35fd tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-08T23:35:01.464Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=0b2bde46-d9c8-d358-755d-356691ce35fd tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-08T23:35:01.814Z [INFO]  backend/local: starting Plan operation
2024-05-08T23:35:02.311Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=88d78886-b814-9efe-f62f-1ab4f779e788 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-08T23:35:02.611Z [INFO]  provider: configuring client automatic mTLS
2024-05-08T23:35:02.699Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-08T23:35:02.699Z
2024-05-08T23:35:03.339Z [INFO]  provider: configuring client automatic mTLS
2024-05-08T23:35:03.348Z [INFO]  provider.terraform-provider-tls_v4.0.5_x5: configuring server automatic mTLS: timestamp=2024-05-08T23:35:03.347Z
2024-05-08T23:35:03.401Z [INFO]  provider: configuring client automatic mTLS
2024-05-08T23:35:03.477Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-08T23:35:03.477Z
2024-05-08T23:35:03.499Z [INFO]  provider: configuring client automatic mTLS
2024-05-08T23:35:03.513Z [INFO]  provider.terraform-provider-tls_v4.0.5_x5: configuring server automatic mTLS: timestamp=2024-05-08T23:35:03.513Z
2024-05-08T23:35:03.629Z [INFO]  backend/local: plan calling Plan
2024-05-08T23:35:03.632Z [INFO]  provider: configuring client automatic mTLS
2024-05-08T23:35:03.640Z [INFO]  provider.terraform-provider-tls_v4.0.5_x5: configuring server automatic mTLS: timestamp=2024-05-08T23:35:03.640Z
2024-05-08T23:35:03.687Z [INFO]  provider: configuring client automatic mTLS
2024-05-08T23:35:03.768Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-08T23:35:03.768Z
2024-05-08T23:35:03.874Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=53d6a17a-a4fa-b782-771a-ca86ccd5fe02 tf_rpc=ConfigureProvider tf_aws.credentials_source=EnvConfigCredentials timestamp=2024-05-08T23:35:03.874Z
2024-05-08T23:35:04.465Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=53d6a17a-a4fa-b782-771a-ca86ccd5fe02 tf_rpc=ConfigureProvider timestamp=2024-05-08T23:35:04.465Z
data.aws_ami.ubuntu: Reading...
2024-05-08T23:35:04.474Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_vpc.algosolved_vpc, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .instance_tenancy: planned value cty.StringVal("default") for a non-computed attribute
      - .enable_dns_support: planned value cty.True for a non-computed attribute
2024-05-08T23:35:04.475Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
2024-05-08T23:35:04.479Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_subnet.private_2, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .map_public_ip_on_launch: planned value cty.False for a non-computed attribute
      - .enable_resource_name_dns_a_record_on_launch: planned value cty.False for a non-computed attribute
      - .ipv6_native: planned value cty.False for a non-computed attribute
      - .enable_dns64: planned value cty.False for a non-computed attribute
      - .enable_resource_name_dns_aaaa_record_on_launch: planned value cty.False for a non-computed attribute
      - .assign_ipv6_address_on_creation: planned value cty.False for a non-computed attribute
2024-05-08T23:35:04.481Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_subnet.private_1, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .enable_dns64: planned value cty.False for a non-computed attribute
      - .enable_resource_name_dns_aaaa_record_on_launch: planned value cty.False for a non-computed attribute
      - .assign_ipv6_address_on_creation: planned value cty.False for a non-computed attribute
      - .enable_resource_name_dns_a_record_on_launch: planned value cty.False for a non-computed attribute
      - .ipv6_native: planned value cty.False for a non-computed attribute
      - .map_public_ip_on_launch: planned value cty.False for a non-computed attribute
2024-05-08T23:35:04.481Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_subnet.public_1, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .enable_resource_name_dns_a_record_on_launch: planned value cty.False for a non-computed attribute
      - .ipv6_native: planned value cty.False for a non-computed attribute
      - .map_public_ip_on_launch: planned value cty.False for a non-computed attribute
      - .enable_dns64: planned value cty.False for a non-computed attribute
      - .enable_resource_name_dns_aaaa_record_on_launch: planned value cty.False for a non-computed attribute
      - .assign_ipv6_address_on_creation: planned value cty.False for a non-computed attribute
2024-05-08T23:35:04.482Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_subnet.public_2, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .enable_dns64: planned value cty.False for a non-computed attribute
      - .enable_resource_name_dns_aaaa_record_on_launch: planned value cty.False for a non-computed attribute
      - .assign_ipv6_address_on_creation: planned value cty.False for a non-computed attribute
      - .enable_resource_name_dns_a_record_on_launch: planned value cty.False for a non-computed attribute
      - .ipv6_native: planned value cty.False for a non-computed attribute
      - .map_public_ip_on_launch: planned value cty.False for a non-computed attribute
2024-05-08T23:35:04.486Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved_security_group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .ingress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 22 from vpc"), "from_port":cty.NumberIntVal(22), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(22)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 443"), "from_port":cty.NumberIntVal(443), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(443)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 5432 from vpc"), "from_port":cty.NumberIntVal(5432), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(5432)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 80"), "from_port":cty.NumberIntVal(80), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(80)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 8080 from vpc"), "from_port":cty.NumberIntVal(8080), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(8080)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 22 from vpc"), "from_port":cty.NumberIntVal(22), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(22)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 443"), "from_port":cty.NumberIntVal(443), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(443)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 5432 from vpc"), "from_port":cty.NumberIntVal(5432), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(5432)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 80"), "from_port":cty.NumberIntVal(80), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(80)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 8080 from vpc"), "from_port":cty.NumberIntVal(8080), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(8080)})})
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
      - .egress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal(""), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("::/0")}), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("-1"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.NullVal(cty.String), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("::/0")}), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("-1"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})
data.aws_ami.ubuntu: Read complete after 2s [id=ami-0720c7fcba4b88b36]
2024-05-08T23:35:05.520Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved_launch_template, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})
      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-08T23:35:05.528Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved_autoscaling_group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute
      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute
      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute
      - .vpc_zone_identifier: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String), cty.UnknownVal(cty.String), cty.UnknownVal(cty.String), cty.UnknownVal(cty.String)})
      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute
      - .protect_from_scale_in: planned value cty.False for a non-computed attribute
      - .force_delete: planned value cty.False for a non-computed attribute
      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute
      - .mixed_instances_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .traffic_source: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-08T23:35:05.539Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.algosolved_autoscaling_group will be created
  + resource "aws_autoscaling_group" "algosolved_autoscaling_group" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 0
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = "algosolved_autoscaling-group"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }
    }

  # aws_ecr_repository.algosolved_repository will be created
  + resource "aws_ecr_repository" "algosolved_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "algosolved"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Name"  = "algosolved"
          + "Stage" = "prod"
        }
    }

  # aws_key_pair.generated_key will be created
  + resource "aws_key_pair" "generated_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "algosolved"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = (known after apply)
    }

  # aws_launch_template.algosolved_launch_template will be created
  + resource "aws_launch_template" "algosolved_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0720c7fcba4b88b36"
      + instance_type          = "t3a.nano"
      + key_name               = "algosolved"
      + latest_version         = (known after apply)
      + name                   = "algosolved-launch-template"
      + name_prefix            = (known after apply)
      + tags                   = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
      + tags_all               = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + iops        = (known after apply)
              + throughput  = (known after apply)
              + volume_size = 50
              + volume_type = "gp3"
            }
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Project" = "algoSolved"
              + "Stage"   = "prod"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Project" = "algoSolved"
              + "Stage"   = "prod"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Project" = "algoSolved"
              + "Stage"   = "prod"
            }
        }
    }

  # aws_security_group.algosolved_security_group will be created
  + resource "aws_security_group" "algosolved_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow 80,443 traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow 22 from vpc"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow 443"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow 5432 from vpc"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow 80"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow 8080 from vpc"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "algosolved-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
      + tags_all               = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private_1 will be created
  + resource "aws_subnet" "private_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
      + tags_all                                       = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_2 will be created
  + resource "aws_subnet" "private_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
      + tags_all                                       = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_1 will be created
  + resource "aws_subnet" "public_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
      + tags_all                                       = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_2 will be created
  + resource "aws_subnet" "public_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
      + tags_all                                       = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.algosolved_vpc will be created
  + resource "aws_vpc" "algosolved_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
      + tags_all                             = {
          + "Project" = "algoSolved"
          + "Stage"   = "prod"
        }
    }

  # tls_private_key.private_key will be created
  + resource "tls_private_key" "private_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_ami.ubuntu: Reading...%0Adata.aws_ami.ubuntu: Read complete after 2s [id=ami-0720c7fcba4b88b36]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_autoscaling_group.algosolved_autoscaling_group will be created%0A  + resource "aws_autoscaling_group" "algosolved_autoscaling_group" {%0A      + arn                              = (known after apply)%0A      + availability_zones               = (known after apply)%0A      + default_cooldown                 = (known after apply)%0A      + desired_capacity                 = 0%0A      + force_delete                     = false%0A      + force_delete_warm_pool           = false%0A      + health_check_grace_period        = 300%0A      + health_check_type                = (known after apply)%0A      + id                               = (known after apply)%0A      + ignore_failed_scaling_activities = false%0A      + load_balancers                   = (known after apply)%0A      + max_size                         = 1%0A      + metrics_granularity              = "1Minute"%0A      + min_size                         = 0%0A      + name                             = "algosolved_autoscaling-group"%0A      + name_prefix                      = (known after apply)%0A      + predicted_capacity               = (known after apply)%0A      + protect_from_scale_in            = false%0A      + service_linked_role_arn          = (known after apply)%0A      + target_group_arns                = (known after apply)%0A      + vpc_zone_identifier              = (known after apply)%0A      + wait_for_capacity_timeout        = "10m"%0A      + warm_pool_size                   = (known after apply)%0A%0A      + launch_template {%0A          + id      = (known after apply)%0A          + name    = (known after apply)%0A          + version = "$Latest"%0A        }%0A    }%0A%0A  # aws_ecr_repository.algosolved_repository will be created%0A  + resource "aws_ecr_repository" "algosolved_repository" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "algosolved"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = {%0A          + "Name"  = "algosolved"%0A          + "Stage" = "prod"%0A        }%0A    }%0A%0A  # aws_key_pair.generated_key will be created%0A  + resource "aws_key_pair" "generated_key" {%0A      + arn             = (known after apply)%0A      + fingerprint     = (known after apply)%0A      + id              = (known after apply)%0A      + key_name        = "algosolved"%0A      + key_name_prefix = (known after apply)%0A      + key_pair_id     = (known after apply)%0A      + key_type        = (known after apply)%0A      + public_key      = (known after apply)%0A      + tags_all        = (known after apply)%0A    }%0A%0A  # aws_launch_template.algosolved_launch_template will be created%0A  + resource "aws_launch_template" "algosolved_launch_template" {%0A      + arn                    = (known after apply)%0A      + default_version        = (known after apply)%0A      + id                     = (known after apply)%0A      + image_id               = "ami-0720c7fcba4b88b36"%0A      + instance_type          = "t3a.nano"%0A      + key_name               = "algosolved"%0A      + latest_version         = (known after apply)%0A      + name                   = "algosolved-launch-template"%0A      + name_prefix            = (known after apply)%0A      + tags                   = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all               = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_security_group_ids = (known after apply)%0A%0A      + block_device_mappings {%0A          + device_name = "/dev/xvda"%0A%0A          + ebs {%0A              + iops        = (known after apply)%0A              + throughput  = (known after apply)%0A              + volume_size = 50%0A              + volume_type = "gp3"%0A            }%0A        }%0A%0A      + tag_specifications {%0A          + resource_type = "instance"%0A          + tags          = {%0A              + "Project" = "algoSolved"%0A              + "Stage"   = "prod"%0A            }%0A        }%0A      + tag_specifications {%0A          + resource_type = "volume"%0A          + tags          = {%0A              + "Project" = "algoSolved"%0A              + "Stage"   = "prod"%0A            }%0A        }%0A      + tag_specifications {%0A          + resource_type = "network-interface"%0A          + tags          = {%0A              + "Project" = "algoSolved"%0A              + "Stage"   = "prod"%0A            }%0A        }%0A    }%0A%0A  # aws_security_group.algosolved_security_group will be created%0A  + resource "aws_security_group" "algosolved_security_group" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow 80,443 traffic"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "allow 22 from vpc"%0A              + from_port        = 22%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 22%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "allow 443"%0A              + from_port        = 443%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 443%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "allow 5432 from vpc"%0A              + from_port        = 5432%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 5432%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "allow 80"%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "allow 8080 from vpc"%0A              + from_port        = 8080%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 8080%0A            },%0A        ]%0A      + name                   = "algosolved-security-group"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all               = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # aws_subnet.private_1 will be created%0A  + resource "aws_subnet" "private_1" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-2c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.102.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all                                       = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.private_2 will be created%0A  + resource "aws_subnet" "private_2" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-2d"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.103.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all                                       = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.public_1 will be created%0A  + resource "aws_subnet" "public_1" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-2a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all                                       = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.public_2 will be created%0A  + resource "aws_subnet" "public_2" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-2b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all                                       = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_vpc.algosolved_vpc will be created%0A  + resource "aws_vpc" "algosolved_vpc" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all                             = {%0A          + "Project" = "algoSolved"%0A          + "Stage"   = "prod"%0A        }%0A    }%0A%0A  # tls_private_key.private_key will be created%0A  + resource "tls_private_key" "private_key" {%0A      + algorithm                     = "RSA"%0A      + ecdsa_curve                   = "P224"%0A      + id                            = (known after apply)%0A      + private_key_openssh           = (sensitive value)%0A      + private_key_pem               = (sensitive value)%0A      + private_key_pem_pkcs8         = (sensitive value)%0A      + public_key_fingerprint_md5    = (known after apply)%0A      + public_key_fingerprint_sha256 = (known after apply)%0A      + public_key_openssh            = (known after apply)%0A      + public_key_pem                = (known after apply)%0A      + rsa_bits                      = 4096%0A    }%0A%0APlan: 11 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-05-08T23:35:00.760Z [INFO]  Terraform version: 1.8.1%0A2024-05-08T23:35:00.760Z [INFO]  Go runtime version: go1.22.1%0A2024-05-08T23:35:00.760Z [INFO]  CLI args: []string{"/home/runner/work/_temp/c5e0f52b-18b9-402e-93a4-1b4107d8c298/terraform-bin", "plan", "-no-color"}%0A2024-05-08T23:35:00.761Z [INFO]  CLI command args: []string{"plan", "-no-color"}%0A2024-05-08T23:35:00.766Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=0b2bde46-d9c8-d358-755d-356691ce35fd tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials%0A2024-05-08T23:35:01.328Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=0b2bde46-d9c8-d358-755d-356691ce35fd tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-08T23:35:01.464Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=0b2bde46-d9c8-d358-755d-356691ce35fd tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-08T23:35:01.814Z [INFO]  backend/local: starting Plan operation%0A2024-05-08T23:35:02.311Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=88d78886-b814-9efe-f62f-1ab4f779e788 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-08T23:35:02.611Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-08T23:35:02.699Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-08T23:35:02.699Z%0A2024-05-08T23:35:03.339Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-08T23:35:03.348Z [INFO]  provider.terraform-provider-tls_v4.0.5_x5: configuring server automatic mTLS: timestamp=2024-05-08T23:35:03.347Z%0A2024-05-08T23:35:03.401Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-08T23:35:03.477Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-08T23:35:03.477Z%0A2024-05-08T23:35:03.499Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-08T23:35:03.513Z [INFO]  provider.terraform-provider-tls_v4.0.5_x5: configuring server automatic mTLS: timestamp=2024-05-08T23:35:03.513Z%0A2024-05-08T23:35:03.629Z [INFO]  backend/local: plan calling Plan%0A2024-05-08T23:35:03.632Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-08T23:35:03.640Z [INFO]  provider.terraform-provider-tls_v4.0.5_x5: configuring server automatic mTLS: timestamp=2024-05-08T23:35:03.640Z%0A2024-05-08T23:35:03.687Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-08T23:35:03.768Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-08T23:35:03.768Z%0A2024-05-08T23:35:03.874Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=53d6a17a-a4fa-b782-771a-ca86ccd5fe02 tf_rpc=ConfigureProvider tf_aws.credentials_source=EnvConfigCredentials timestamp=2024-05-08T23:35:03.874Z%0A2024-05-08T23:35:04.465Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=53d6a17a-a4fa-b782-771a-ca86ccd5fe02 tf_rpc=ConfigureProvider timestamp=2024-05-08T23:35:04.465Z%0A2024-05-08T23:35:04.474Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_vpc.algosolved_vpc, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .instance_tenancy: planned value cty.StringVal("default") for a non-computed attribute%0A      - .enable_dns_support: planned value cty.True for a non-computed attribute%0A2024-05-08T23:35:04.475Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute%0A2024-05-08T23:35:04.479Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_subnet.private_2, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .map_public_ip_on_launch: planned value cty.False for a non-computed attribute%0A      - .enable_resource_name_dns_a_record_on_launch: planned value cty.False for a non-computed attribute%0A      - .ipv6_native: planned value cty.False for a non-computed attribute%0A      - .enable_dns64: planned value cty.False for a non-computed attribute%0A      - .enable_resource_name_dns_aaaa_record_on_launch: planned value cty.False for a non-computed attribute%0A      - .assign_ipv6_address_on_creation: planned value cty.False for a non-computed attribute%0A2024-05-08T23:35:04.481Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_subnet.private_1, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .enable_dns64: planned value cty.False for a non-computed attribute%0A      - .enable_resource_name_dns_aaaa_record_on_launch: planned value cty.False for a non-computed attribute%0A      - .assign_ipv6_address_on_creation: planned value cty.False for a non-computed attribute%0A      - .enable_resource_name_dns_a_record_on_launch: planned value cty.False for a non-computed attribute%0A      - .ipv6_native: planned value cty.False for a non-computed attribute%0A      - .map_public_ip_on_launch: planned value cty.False for a non-computed attribute%0A2024-05-08T23:35:04.481Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_subnet.public_1, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .enable_resource_name_dns_a_record_on_launch: planned value cty.False for a non-computed attribute%0A      - .ipv6_native: planned value cty.False for a non-computed attribute%0A      - .map_public_ip_on_launch: planned value cty.False for a non-computed attribute%0A      - .enable_dns64: planned value cty.False for a non-computed attribute%0A      - .enable_resource_name_dns_aaaa_record_on_launch: planned value cty.False for a non-computed attribute%0A      - .assign_ipv6_address_on_creation: planned value cty.False for a non-computed attribute%0A2024-05-08T23:35:04.482Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_subnet.public_2, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .enable_dns64: planned value cty.False for a non-computed attribute%0A      - .enable_resource_name_dns_aaaa_record_on_launch: planned value cty.False for a non-computed attribute%0A      - .assign_ipv6_address_on_creation: planned value cty.False for a non-computed attribute%0A      - .enable_resource_name_dns_a_record_on_launch: planned value cty.False for a non-computed attribute%0A      - .ipv6_native: planned value cty.False for a non-computed attribute%0A      - .map_public_ip_on_launch: planned value cty.False for a non-computed attribute%0A2024-05-08T23:35:04.486Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved_security_group, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .ingress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 22 from vpc"), "from_port":cty.NumberIntVal(22), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(22)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 443"), "from_port":cty.NumberIntVal(443), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(443)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 5432 from vpc"), "from_port":cty.NumberIntVal(5432), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(5432)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 80"), "from_port":cty.NumberIntVal(80), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(80)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 8080 from vpc"), "from_port":cty.NumberIntVal(8080), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(8080)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 22 from vpc"), "from_port":cty.NumberIntVal(22), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(22)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 443"), "from_port":cty.NumberIntVal(443), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(443)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 5432 from vpc"), "from_port":cty.NumberIntVal(5432), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(5432)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 80"), "from_port":cty.NumberIntVal(80), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(80)}), cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow 8080 from vpc"), "from_port":cty.NumberIntVal(8080), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(8080)})})%0A      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute%0A      - .egress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal(""), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("::/0")}), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("-1"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.NullVal(cty.String), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("::/0")}), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("-1"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})%0A2024-05-08T23:35:05.520Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved_launch_template, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})%0A      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-08T23:35:05.528Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved_autoscaling_group, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute%0A      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute%0A      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute%0A      - .vpc_zone_identifier: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String), cty.UnknownVal(cty.String), cty.UnknownVal(cty.String), cty.UnknownVal(cty.String)})%0A      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute%0A      - .protect_from_scale_in: planned value cty.False for a non-computed attribute%0A      - .force_delete: planned value cty.False for a non-computed attribute%0A      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute%0A      - .mixed_instances_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .traffic_source: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-08T23:35:05.539Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```

</details>




**Pusher: @rha6780**